controllers/BetController.php

    protected function findMatchModel($id)
    {
        if (($model = Match::findOne($id)) !== null) {
---
SELECT * FROM `match` WHERE `id`=28

    protected function findUserModel($id)
    {
        if (($model = User::findOne($id)) !== null) {
---
SELECT * FROM `user` WHERE `id`='55'