models/Bet.php

    public static function isExist($user_id, $match_id)
    {
        $model = self::findOne(['user_id' => $user_id, 'match_id' => $match_id]);
---
SELECT * FROM `bet` WHERE (`user_id`='1') AND (`match_id`='18')